#include <stdio.h>
#include <iostream>
#include <ctime>
#include <locale.h>

int random(int a, int b)
{
	srand(time(NULL));
	if (a > 0)
		return a + rand() % (b - a);
}
void ostro_fras(int a)
{
	switch (a)
	{
	case 1:
	{
		printf("Ты все еще не угадал, эх мне так жаль тебя. \n");
		break;
	}
	case 2:
	{
		printf("Еще чуть-чуть и у тебя получится отгадать число. \n");
		break;
	}
	case 3:
	{
		printf("Даже я уже знаю это число, а ты до сих пор нет. \n");
		break;
	}
	case 4:
	{
		printf("Удача отвернулась от тебя пользователь. Мухахахаххахa. \n");
	}
	}
}
/*int gadalka(int d_1, int d_2, int n)
{
	char ci;
	int g = random(d_1, d_2);
	printf("Число высшего разума(нет) = %d \n", g);
	scanf_s("%c", &ci);
	if (ci == '>')
	{

		gadalka(d_1, g, n + 1);
	}
	else if (ci == '<')
	{
		gadalka(g, d_2, n + 1);
	}
	else
		return n;
}*/
void main()
{
	setlocale(LC_ALL, "Rus");
	int choose;
	printf("Кого унижать вас(1) или компьюктер(2)???\n");
	scanf_s("%d", &choose);
	if (choose == 1)
	{
		int i = random(1, 1000);
		printf("Загаданное число компом = %d \n", i);
		bool flag = true;
		int a;
		printf("Компьютер уже загадал число в диапазоне от 1 до 1000, а чего ждешь ты? Отгадывай давай!\n");
		while (flag)
		{
			scanf_s("%d", &a);
			if (i == a)
			{
				flag = false;
				printf("Вы угадали! Похлопайте себе.\n");
			}
			else
			{
				ostro_fras(random(1, 4));
				if (a > i)
					printf("Дам подсказку, твое число больше нужного тебе числа\n");
				else
					printf("Дам подсказку, твое число меньше нужного тебе числа\n");
			}
		}
	}
	else
	{
		int b, n, d_1, d_2, ch;
		char otvet = 'kl';
		printf("Введите число от 1 до 1000\n");
		scanf_s("%d", &b);
		n = 1;
		d_1 = 1;
		d_2 = 1000;
		ch = random(d_1, d_2);
		printf("Очередной ответ компа %d \n", ch);

		while (otvet != '=')
		{
			scanf_s("%c", &otvet);
			if (otvet == '>')
			{
				d_1 = ch;
				ch = random(d_1, d_2);
				printf("Очередной ответ компа %d \n", ch);
				n++;
			}
			else if (otvet == '<')
			{
				d_2 = ch;
				ch = random(d_1, d_2);
				printf("Очередной ответ компа %d \n", ch);
				n++;
			}
		}

		printf("Компьютер вас превзошел и отгадал с %d попытки?", n);
	}

	while (true);


}











































/*
.
░░░░░░░▄▀▀▄░░░░░░░░░░░░
░░░░░▄▀▒▒▒▒▀▄░ЗАПУСКАЕМ░░
░░░░░░▀▌▒▒▐▀░░ГУСЕПЕТУХА░░
▄███▀░◐░░░▌░░░РАБОТЯГИ░░░
░░▐▀▌░░░░░▐░░░░░░░░░▄▀▀▀▄▄
░▐░░▐░░░░░▐░░░░░░░░░█░▄█▀
░▐▄▄▌░░░░░▐▄▄░░░░░░█░░▄▄▀▀▀▀▄
░░░░▌░░░░▄▀▒▒▀▀▀▀▄▀░▄▀░▄▄▄▀▀
░░░▐░░░░▐▒▒▒▒▒▒▒▒▀▀▄░░▀▄▄▄░▄
░░░▐░░░░▐▄▒▒▒▒▒▒▒▒▒▒▀▄░▄▄▀▀
░░░░▀▄░░░░▀▄▒▒▒▒▒▒▒▒▒▒▀▄░
░░░░░▀▄▄░░░█▄▄▄▄▄▄▄▄▄▄▄▀▄
░░░░░░░░▀▀▀▄▄▄▄▄▄▄▄▀▀░
░░░░░░░░░░░▌▌░▌▌
░░░░░░░░░▄▄▌▌▄▌▌

.
░░░░░░░▄▀▀▄░░░░░░░░░░░░
░░░░░▄▀▒▒▒▒▀▄░ЗАПУСКАЕМ░░
░░░░░░▀▌▒▒▐▀░░ГУСЕПЕТУХА░░
▄███▀░◐░░░▌░░░РАБОТЯГИ░░░
░░▐▀▌░░░░░▐░░░░░░░░░▄▀▀▀▄▄
░▐░░▐░░░░░▐░░░░░░░░░█░▄█▀
░▐▄▄▌░░░░░▐▄▄░░░░░░█░░▄▄▀▀▀▀▄
░░░░▌░░░░▄▀▒▒▀▀▀▀▄▀░▄▀░▄▄▄▀▀
░░░▐░░░░▐▒▒▒▒▒▒▒▒▀▀▄░░▀▄▄▄░▄
░░░▐░░░░▐▄▒▒▒▒▒▒▒▒▒▒▀▄░▄▄▀▀
░░░░▀▄░░░░▀▄▒▒▒▒▒▒▒▒▒▒▀▄░
░░░░░▀▄▄░░░█▄▄▄▄▄▄▄▄▄▄▄▀▄
░░░░░░░░▀▀▀▄▄▄▄▄▄▄▄▀▀░
░░░░░░░░░░░▌▌░▌▌
░░░░░░░░░▄▄▌▌▄▌▌

.
░░░░░░░▄▀▀▄░░░░░░░░░░░░
░░░░░▄▀▒▒▒▒▀▄░ЗАПУСКАЕМ░░
░░░░░░▀▌▒▒▐▀░░ГУСЕПЕТУХА░░
▄███▀░◐░░░▌░░░РАБОТЯГИ░░░
░░▐▀▌░░░░░▐░░░░░░░░░▄▀▀▀▄▄
░▐░░▐░░░░░▐░░░░░░░░░█░▄█▀
░▐▄▄▌░░░░░▐▄▄░░░░░░█░░▄▄▀▀▀▀▄
░░░░▌░░░░▄▀▒▒▀▀▀▀▄▀░▄▀░▄▄▄▀▀
░░░▐░░░░▐▒▒▒▒▒▒▒▒▀▀▄░░▀▄▄▄░▄
░░░▐░░░░▐▄▒▒▒▒▒▒▒▒▒▒▀▄░▄▄▀▀
░░░░▀▄░░░░▀▄▒▒▒▒▒▒▒▒▒▒▀▄░
░░░░░▀▄▄░░░█▄▄▄▄▄▄▄▄▄▄▄▀▄
░░░░░░░░▀▀▀▄▄▄▄▄▄▄▄▀▀░
░░░░░░░░░░░▌▌░▌▌
░░░░░░░░░▄▄▌▌▄▌▌


*/